In [2]:
import pandas as pd

Import titanic passenger data

Note: please upload `titanic.csv` file using File Explorer tool on your left

![image.png]()

In [3]:
titanic = pd.read_csv('titanic.csv')
titanic

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

Calculate the average age of passeners
(1 point)

In [ ]:
age_data = titanic["Age"]
age_data.mean()

29.69911764705882

Calculate the percentage of male and female passengers
(1 point)

In [ ]:
n_all = len(titanic.index)  # number of all passengers
n_male =  len(titanic[titanic["Sex"] == "male"]) # Your code here
n_female =  len(titanic[titanic["Sex"] == "female"]) # Your code here
print(f'male: {n_male/n_all*100:.1f}%, female: {n_female/n_all*100:.1f}%')

male: 64.8%, female: 35.2%

Create a DataFrame of passenger who survived
(1 point)

In [ ]:
titanic_survived =  pd.DataFrame({
    'Name' : titanic["Name"],
    'Survived' : titanic["Survived"] == 1
}) # Your code here
titanic_survived

                                                  Name  Survived
0                              Braund, Mr. Owen Harris     False
1    Cumings, Mrs. John Bradley (Florence Briggs Th...      True
2                               Heikkinen, Miss. Laina      True
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)      True
4                             Allen, Mr. William Henry     False
..                                                 ...       ...
886                              Montvila, Rev. Juozas     False
887                       Graham, Miss. Margaret Edith      True
888           Johnston, Miss. Catherine Helen "Carrie"     False
889                              Behr, Mr. Karl Howell      True
890                                Dooley, Mr. Patrick     False

[891 rows x 2 columns]

What's the average age of survived passengers compared to those who did not survive?
(1 point)

In [9]:
import numpy as np
sum_age_survived = []
sum_age_did_not_survived = []
titanic["Age"] = titanic["Age"].replace(np.NaN, 999)
for i in range(len(titanic.index)):
  if titanic["Age"][i] == 999:
    pass
  else:
    if titanic["Survived"][i] == 1:
      sum_age_survived.append(titanic["Age"][i])
    else:
      sum_age_did_not_survived.append(titanic["Age"][i])
mean_age_survived = sum(sum_age_survived) / len(sum_age_survived)# Your code here
mean_age_did_not_survive = sum(sum_age_did_not_survived) / len(sum_age_did_not_survived) # Your code here
print(f'mean_age_survived: {mean_age_survived:.1f}, mean_age_did_not_survive: {mean_age_did_not_survive:.1f}')

mean_age_survived: 28.3, mean_age_did_not_survive: 30.6

Rename passengers who did not survive to 'anonymous'
(2 points)

In [ ]:
titanic_renamed = titanic.copy()
# Your code here
for i in range(len(titanic_renamed.index)):
  if titanic_renamed["Survived"][i] == 0:
    titanic_renamed["Name"][i] = "anonymous"
titanic_renamed

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

Calculate average fare for passenger class (Pclass) 1, 2, and 3
(2 points)

In [ ]:
sum_fare_c1 = 0
sum_fare_c2 = 0
sum_fare_c3 = 0
for i in range(len(titanic.index)):
  if titanic["Pclass"][i] == 1:
    sum_fare_c1 += titanic["Fare"][i]
  elif titanic["Pclass"][i] == 2:
    sum_fare_c2 += titanic["Fare"][i]
  elif titanic["Pclass"][i] == 3:
    sum_fare_c3 += titanic["Fare"][i]    
avg_class_1 = sum_fare_c1 / len(titanic.index)  # Your code here
avg_class_2 = sum_fare_c2 / len(titanic.index) # Your code here
avg_class_3 = sum_fare_c3 / len(titanic.index)  # Your code here
print(f'Average fare by class - 1st Class: {avg_class_1:.1f}, 2nd Class: {avg_class_2:.1f}, 3rd Class: {avg_class_3:.1f}')

Average fare by class - 1st Class: 20.4, 2nd Class: 4.3, 3rd Class: 7.5

Calculate the percentage of passengers who survived in each class
(2 points)

In [ ]:
n_1 = 0  # Your code here
n_2 = 0  # Your code here
n_3 = 0  # Your code here

n_survived_1 = 0  # Your code here
n_survived_2 = 0  # Your code here
n_survived_3 = 0  # Your code here

for i in range(len(titanic.index)):
  if titanic["Pclass"][i] == 1:
    n_1 += 1
    if titanic["Survived"][i] == 1:
      n_survived_1 += 1
  elif titanic["Pclass"][i] == 2:
    n_2 += 1
    if titanic["Survived"][i] == 1:
      n_survived_2 += 1
  elif titanic["Pclass"][i] == 3:
    n_3 += 1
    if titanic["Survived"][i] == 1:
      n_survived_3 += 1        
print(f'Survival by class - 1st Class: {n_survived_1/n_1*100:.1f}%, 2nd Class: {n_survived_2/n_2*100:.1f}%, 3rd Class: {n_survived_3/n_3*100:.1f}%')

Survival by class - 1st Class: 63.0%, 2nd Class: 47.3%, 3rd Class: 24.2%